import React from 'react';
import {View, Text, TextInput, StyleSheet, ScrollView} from 'react-native';
import CustomText from '../../common/CustomText';

const Service = () => {
  return (
    <View style={{backgroundColor: '#fff'}}>
      <ScrollView contentContainerStyle={styles.container}>
        <CustomText style={styles.text}>
          서비스 이용약관{'\n'}
          {'\n'}제 1장 총칙{'\n'}
          {'\n'}
          제1조 (목적){'\n'}본 약관은 본인확인서비스 대행기관인 주식회사
          드림시큐리티(이하 “회사”라 합니다)와 본인확인서비스 이용자(이하
          “이용자”라 합니다) 간에 본인확인서비스(이하 “서비스”라 합니다) 이용에
          관한 “회사”와 “이용자”의 권리와 의무, 기타 제반 사항을 정함을 목적으로
          합니다.{'\n'}
          {'\n'}
          제2조 (용어의 정의){'\n'}본 약관에서 사용하는 용어의 의미는 다음과
          같습니다.{'\n'}① "본인확인서비스"라 함은 “이용자”가 유무선 인터넷의
          웹사이트 및 스마트폰 Application 등(이하 "사이트"라 합니다.)에서 본인
          명의로 개통한 휴대폰을 이용하여, "본인확인정보"를 입력하고 인증 절차를
          통하여 본인 여부와 본인이 등록한 정보의 정확성을 확인하여 주는
          서비스를 말합니다.{'\n'}② "본인확인정보"라 함은 “이용자”가 입력한
          본인의 생년월일, 성별, 성명, 내/외국인 여부, 이동통신사, 본인명의로
          개통된 휴대폰번호, 기타 본인확인기관과 “이용자”간에 별도로 설정한 번호
          등 "이용자"의 본인 여부 확인에 필요한 정보를 말합니다.{'\n'}③
          "이용자"라 함은 "사이트"에서 본인확인기관이 제공하는
          "본인확인서비스"를 이용하는 자를 말합니다.{'\n'}④ "본인확인기관"이란
          주민등록번호를 사용하지 아니하고 “본인확인서비스”를 제공하는 자로
          방송통신위원회로부터 본인확인기관으로 지정받은 자를 말합니다.{'\n'}
          ⑤"대행기관"은 본인확인기관을 대신하여 "이용자"가 "사이트"에서
          "본인확인서비스"를 제공받을 수 있도록 "사이트"와 본인확인기관간의
          "본인확인서비스"를 중계하고 "이용자"에게 이용방법의 안내와 문의 등
          지원업무를 담당하여서, "사이트"에서 "이용자"에게 "본인확인서비스"를
          대행하여 제공하는 사업자를 말합니다.{'\n'}⑥ "사이트"라 함은 유무선
          인터넷의 Web사이트, 스마트폰 Application(Apps)을 통하여 "이용자"에게
          “서비스”, Contents, Point 등의 각종 재화와 용역을 유/무료로 제공하는
          사업자 및 기관, 단체를 말합니다.{'\n'}
          {'\n'}
          제3조 (약관의 효력 및 변경){'\n'}① “회사”는 본 약관을 “서비스” 초기
          화면과 홈페이지에 게시하는 등의 방법으로 “이용자”에게 공지합니다.
          {'\n'}② “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를
          명시하여 현행 약관과 함께 그 개정약관의 적용일자 7일 전부터
          공지합니다. 다만, “이용자”에게 불리한 사항의 약관변경의 경우에는
          적용일자 30일 전부터 공지하여 제1항에서 정한 방법으로 “이용자”에게
          통지합니다.{'\n'}③ “회사”가 2항에 따라 개정약관을 통지하였음에도
          “이용자”가 명시적으로 약관 개정에 대한 거부 의사를 표시하지 아니한
          경우 “회사”는 “이용자”가 개정약관에 동의한 것으로 간주합니다.{'\n'}④
          “이용자” 또는 “사이트”가 변경된 약관에 대한 내용을 알지 못하여
          발생하는 손해 및 피해에 대해서는 회사는 일체 책임을 지지 않습니다.
          {'\n'}⑤ “회사”의 약관은 개인정보보호 등을 규정한 정보통신 이용촉진 및
          정보보호 등에 관한 법률 등 관련 법령에서 정한 절차와 범위 내에서만
          유효합니다.{'\n'}
          {'\n'}
          제4조 (약관 외 준칙){'\n'}본 약관에 명시되지 아니한 사항에 대해서는
          「정보통신망 이용 촉진 및 정보보호 등에 관한 법률」 등 기타 관련 법령
          또는 일반 관례에 따릅니다.{'\n'}
          {'\n'}
          {'\n'}제 2장 서비스의 이용 등{'\n'}
          {'\n'}
          제5조 (“서비스”의 종류){'\n'}① “회사”는 “이용자”에게
          휴대폰본인확인서비스를 제공합니다.{'\n'}② 1항의 휴대폰본인확인서비스란
          “회사”가 “본인확인기관”에서 “이용자” 확인 후 제공하는 “이용자”의
          정보를 “사이트”에 전달하고, “이용자” 본인임을 “사이트”에서 확인하는
          서비스를 말합니다.{'\n'}③ 2항에서 “본인확인기관”이 “이용자”를 확인하는
          방법은 다음 각 호와 같습니다.{'\n'}
          1. SMS 인증을 통한 소지확인{'\n'}
          2. PASS 인증을 통한 소지확인{'\n'}
          3. ARS 인증을 통한 소지확인{'\n'}
          {'\n'}
          제6조 (“서비스” 제공시간){'\n'}① “서비스”의 제공시간은 연중무휴 1일
          24시간을 원칙으로 합니다. 다만 천재지변 또는 정기 점검 및 기타
          기술/운영상의 사유와 목적에 따라 “회사”가 정한 기간에 일시 중지될 수
          있습니다.{'\n'}② “회사”는 1항에서 명시한 “서비스” 중지에 대하여
          “이용자”에게 별도의 보상은 하지 않습니다{'\n'}
          {'\n'}
          제7조 (“서비스” 이용 책임){'\n'}① “이용자”는 “회사”와 서면으로 계약한
          범위 이외에 “회사”가 제공하는 “서비스”를 이용하여 상품 및 용역을
          판매하는 등의 일체의 영업활동을 할 수 없습니다. 특히 해킹,
          음란사이트를 통한 상업 행위 등 엄격히 금지됩니다.{'\n'}② “이용자”가
          제1항을 위반하여 수행한 영업활동의 결과 발생하는 손실, 민, 형사상의
          법적조치 등 일체의 결과에 대해 “회사”는 아무런 책임이 없습니다.{'\n'}③
          제1항에 위반하여 수행하는 영업활동으로 인하여 “회사”에 손해를 발생시킨
          “이용자”는 “회사”에 그 손해를 배상하여야 합니다.{'\n'}
          {'\n'}
          제8조 (서비스 제공의 변경 중지 등){'\n'}① “회사”는 다음 각 호의 어느
          하나에 해당하는 사유가 있는 경우, 서비스의 일부 또는 전부의 제공을
          제한하거나 중단할 수 있습니다.{'\n'}
          1. “이용자”가 “회사”의 서비스 운영을 고의·과실로 방해하는 경우{'\n'}
          2. 천재지변 등 재해. 재난이 발생하여 “서비스” 제공에 지장이 있는 경우
          {'\n'}
          3. 정전, 제반 설비의 장애 등으로 정상적인 “서비스” 제공에 지장이 있는
          경우{'\n'}
          4. “서비스” 운영 제반 설비의 유지보수 등을 위한 정기 또는 임시 점검의
          경우{'\n'}
          5. 기타 불가항력적인 사유로 정상적인 “서비스” 제공이 불가능한 경우
          {'\n'}
          {'\n'}① 1항 2호에 의해 서비스가 제한되거나 중단되는 경우 “회사”는
          ”서비스” 홈페이지를 통해 “이용자”에게 통지합니다. 다만, “회사”가
          부득이한 사유로 인하여 통지가 불가능한 경우 사후 통지를 할 수
          있습니다.
          {'\n'}② “회사”는 불가피한 사정으로 인하여 “서비스” 전부 또는 일부를
          휴지할 수 있습니다. 이 경우 “회사”는 휴지 시작일 30일 전까지 “서비스”
          홈페이지를 통해 “이용자”에게 통지합니다.{'\n'}③ “회사”는 불가피한
          사정으로 인하여 “서비스”를 종료할 수 있습니다. 이 경우 “회사”는 종료
          60일 전까지 “서비스” 홈페이지를 통해 “이용자”에게 통지합니다.{'\n'}
          {'\n'}
          {'\n'}제 3장 회사와 이용자의 의무{'\n'}
          {'\n'}
          제9조 (“회사”의 권리와 의무){'\n'}① “회사”는 “서비스”와 관련하여
          수집한 “이용자”의 “본인확인정보”를 본인의 승낙 없이 제3자에게
          누설하거나 배포하지 않습니다. 단, 국가기관의 요구가 있는 경우, 범죄에
          대한 수사상의 목적이 있는 경우 및 기타 관계 법령에서 정한 절차에 따른
          요청이 있는 경우에는 그러하지 않습니다.{'\n'}② “회사”는 “이용자”에게
          안정적인 “서비스”를 위하여 지속적으로 관련 시스템이나 절차, 기능 등의
          예방점검, 유지보수 등을 이행하며, “서비스”의 장애가 발생하는 경우,
          이를 지체없이 수리 및 복구합니다.{'\n'}③ “회사”는 “서비스”의 안전성과
          신뢰성, 보안성을 확보하기 위하여 개인정보 처리시스템의 해킹방지시스템
          및 보안관리 체계 운영 등 기술적, 관리적 조치를 취합니다.{'\n'}④
          “회사”는 서버 및 통신기기의 정상작동 여부 확인을 위하여 정보처리시스템
          자원 상태의 감시, 경고 및 제어가 가능한 모니터링 체계를 갖춥니다.
          {'\n'}⑤ “회사”는 해킹 침해 방지를 위하여 다음 각 호의 시스템 및
          프로그램을 설치하여 운영합니다.{'\n'}
          {'\n'}
          1. 침입 차단 및 탐지시스템{'\n'}
          2. 그 밖에 필요한 보호장비 또는 암호프로그램 등 정보보호시스템{'\n'}⑥
          “회사”는 컴퓨터바이러스 감염을 방지하기 위하여 바이러스 방지를 위한
          방어, 탐색, 복구 절차를 자체적으로 운영합니다.{'\n'}
          {'\n'}
          제10조 (“이용자”의 권리와 의무){'\n'}① “이용자”는 “서비스”를 이용함에
          있어서 다음 각호에 해당하는 행위를 하여서는 안되며, “회사”는 위반
          행위에 따르는 일체의 법적 책임을 지지 않습니다.{'\n'}
          1. 본인이 아닌 타인의 본인확인정보를 부정하게 사용 및 도용하는 행위
          {'\n'}
          2. ”회사” 및 “본인확인기관”, “사이트”의 저작권, 제3자의 저작권 등 기타
          권리를 침해하는 행위{'\n'}
          3. 법령에 규정하는 제반 범죄 및 위법 행위{'\n'}② “이용자”는 본
          약관에서 규정하는 사항과 “서비스”에 대한 이용안내 또는 주의사항 등을
          준수하여야 합니다.{'\n'}③ “이용자”는 본인의 접근매체, 본인확인정보의
          분실, 유출, 누설없이 본인 스스로 성실히 관리하여야 합니다.{'\n'}④
          “이용자”는 “회사”의 고객센터를 통하여 관련 문의를 할 수 있습니다.
          {'\n'}
          “회사”는 “이용자”의 민원대응을 목적으로 고객센터를 운영합니다.{'\n'}
          《고객센터 연락처 : 1899-4134, www.mobile-ok.com》{'\n'}⑤ “이용자”는
          “본인확인서비스”가 자신의 의사에 반하여 특정 사이트에 제공되었음을 안
          때에는 “본인확인기관” 또는 “회사”를 통하여 자신의 “본인확인정보”
          삭제를 요구할 수 있으며, “본인확인기관” 또는 “회사”는 그 정정요구를
          받은 날부터 2주 이내에 처리 결과를 알려 주어야 합니다.{'\n'}
          {'\n'}
          제11조 (“이용자”의 개인정보보호){'\n'}본 약관에서 사용하는 용어의
          정의는 다음 각 호와 같습니다.{'\n'}① “회사”는 “서비스”를 운영함에 있어
          취득한 “이용자”의 정보 또는 자료를 “이용자”의 동의 없이 제3자에게
          제공, 누설하거나 업무상 목적 외에 사용하지 않습니다.{'\n'}② “이용자”의
          개인정보 보호는 “회사”가 관련 법령과 “회사”가 수립하여 운영하는
          개인정보 취급방침에 따릅니다.{'\n'}
          《개인정보처리방침: https://www.mobile-ok.com/term.html?term=privacy》
          {'\n'}
          {'\n'}
          부칙{'\n'}
          (시행일) 이 약관은 2024년 08월 21일부터 시행합니다.{'\n'}
        </CustomText>
      </ScrollView>
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default Service;
