import React from 'react';
import {View, Text, StyleSheet, ScrollView} from 'react-native';
import CustomText from '../../../../utils/CustomText';

const KTpersonalinfo = () => {
  return (
    <View contentContainerStyle={styles.container}>
      <CustomText style={styles.text}>
        개인정보 이용 동의 [(주)케이티 귀중]{'\n'}
        {'\n'}
        (주)케이티(이하 ‘회사’라 함)가 제공하는 본인확인서비스를 이용하기 위해,
        다음과 같이 ‘회사’가 본인의 개인정보를 수집 및 이용하고, 개인정보의
        취급을 위탁하는 것에 동의합니다.{'\n'}
        {'\n'}
        1. 수집항목{'\n'}- 이용자가 가입한 이동통신사, 휴대폰번호, 성명, 성별,
        생년월일, 내/외국인 구분{'\n'}- 연계정보(CI), 중복가입확인정보(DI){'\n'}
        - 이용자가 본인확인을 요청한 서비스명 및 URL정보, 본인확인 이용일시, IP
        주소{'\n'}
        {'\n'}
        2. 이용목적{'\n'}- 인터넷사업자의 서비스(회원가입, ID/PW 찾기 등) 이용에
        필요한 이용자 본인확인 여부 및 정보 전달{'\n'}
        (※ 이용자가 본인확인을 요청한 인터넷사업자에 한함){'\n'}- (주)케이티 등
        이동통신사에 이용자 정보를 전송하여 본인확인 및 휴대폰 정보의 일치 여부
        확인{'\n'}- 휴대폰 사용자 확인을 위한 SMS 인증번호 전송{'\n'}- 부정 이용
        방지{'\n'}- 이용자 본인 요청에 의한 본인확인 이력정보 제공{'\n'}-
        휴대폰번호도용방지서비스 가입여부 확인(서비스 가입자에 한함){'\n'}- 기타
        법률에서 정한 목적{'\n'}
        {'\n'}
        3. 개인정보의 보유기간 및 이용기간{'\n'}
        "회사"는 이용자의 개인정보를 이용목적이 달성되거나 보유 및 보존기간이
        종료되면 해당 정보를 지체 없이 파기하며 별도의 보관을 하지 않습니다.
        {'\n'}
        단, 아래의 경우는 제외합니다.{'\n'}- 법령에서 정하는 경우 해당 기간까지
        보유(상세 사항은 회사의 개인정보처리방침에 따름){'\n'}
        {'\n'}
        4. 본인확인서비스 제공을 위한 개인정보의 취급위탁{'\n'}- 수탁자:
        (주)드림시큐리티{'\n'}- 위탁업무: 본인확인정보의 정확성 여부 확인,
        연계정보(CI) 및 중복가입확인정보(DI) 전송, 서비스 관련 상담 및 불만 처리
        등{'\n'}
        {'\n'}
        5. 위 개인정보 수집, 이용 및 취급위탁에 동의하지 않을 권리가 있으며,
        동의하지 않으실 경우 서비스를 이용할 수 없습니다.{'\n'}
        ‘회사’가 제공하는 서비스의 개인정보 취급과 관련된 사항은 아래의 ‘회사’
        홈페이지에 기재된 개인정보취급방침에 따릅니다.{'\n'}- (주)케이티:
        www.kt.com{'\n'}
        {'\n'}
        본인은 상기 내용을 숙지하였으며 이에 동의합니다.{'\n'}
        {'\n'}
        [드림시큐리티(주) 귀중]{'\n'}
        (주)드림시큐리티(이하 "회사")는 (주)케이티 통신사로부터 위탁받아
        제공하는 휴대폰 본인인증 서비스와 관련하여 고객으로부터 수집한
        개인정보를 이용 및 제공하고자 합니다.{'\n'}
        이에 본인은 “회사”가 아래와 같이 본인의 개인정보를 이용 및 제공하는데
        동의합니다.{'\n'}
        {'\n'}
        제1조 (개인정보의 수집 및 이용목적){'\n'}
        "회사"는 "고객"의 개인정보를 아래의 목적으로 이용할 수 있습니다.{'\n'}①
        휴대폰기반 본인확인 서비스 제공{'\n'}② 휴대폰 본인인증 서비스 문의사항
        응대{'\n'}③ 부정사용 방지{'\n'}④ 휴대폰번호도용방지서비스
        가입여부확인(서비스 가입자에 한함){'\n'}
        {'\n'}
        제2조 (수집하는 개인정보의 항목){'\n'}- 성명, 성별, 생년월일, 내/외국인
        구분{'\n'}- 연계정보(CI), 중복가입확인정보(DI){'\n'}- 휴대폰번호,
        이동통신사, IP주소{'\n'}
        {'\n'}
        제3조 (개인정보의 보유 및 이용기간){'\n'}
        “회사”는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터
        개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를
        처리·보존합니다.{'\n'}① 휴대폰기반 본인확인 서비스 제공: 목적 달성 후
        즉시 파기{'\n'}② 휴대폰 본인인증 서비스 문의사항 응대: 2년{'\n'}③
        부정사용 방지: 2년{'\n'}④ 휴대폰번호도용방지서비스 가입여부확인: 목적
        달성 후 즉시 파기{'\n'}
        {'\n'}
        제4조 (개인정보의 제공){'\n'}① 휴대폰기반 본인확인 서비스 제공{'\n'}-
        제공 받는 자: “회사”와 계약을 체결한 사업자(가맹점){'\n'}- 제공 목적:
        휴대폰기반 본인확인{'\n'}- 제공 항목: 성명, 생년월일, 성별, 휴대폰번호,
        내/외국인 구분, 연계정보(CI), 중복가입확인정보(DI){'\n'}- 보유 기간:
        처리목적 달성 후 즉시 파기 (단, 관계 법령의 규정에 의하여 보존할 필요가
        있는 경우 및 사전 동의를 득한 경우 해당 보유기간 동안 보관){'\n'}
        {'\n'}② 휴대폰번호도용방지서비스 가입여부확인{'\n'}- 제공 받는 자:
        (주)헥토파이낸셜{'\n'}- 제공 목적: 휴대폰번호도용방지서비스 가입여부확인
        {'\n'}- 제공 항목: 휴대폰번호, 이동통신사{'\n'}
        {'\n'}※ 개인정보 수집·이용 및 제공에 따른 동의는 거부할 수 있습니다.
        다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.
      </CustomText>
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default KTpersonalinfo;
