import React from 'react';
import {View, StyleSheet} from 'react-native';
import CustomText from '../../../../utils/CustomText';

const LGUpersonalinfo = () => {
  return (
    <View contentContainerStyle={styles.container}>
      <CustomText style={styles.text}>
        개인정보 이용 동의{'\n'}
        [LG유플러스㈜ 귀중]{'\n'}
        {'\n'}
        ㈜엘지유플러스(이하 '회사') 휴대폰 본인확인 서비스(이하 ‘서비스’)를
        제공하기 위해 본인의 개인정보를 수집 및 이용합니다.{'\n'}
        {'\n'}
        1. 수집 및 이용 목적{'\n'}- 고객이 웹사이트 또는 Application 등에 입력한
        본인확인정보의 정확성 여부 확인{'\n'}- 해당 웹사이트 또는 Application
        등에 연계정보(CI)와 중복가입확인정보(DI) 전송{'\n'}- 서비스 관련 상담 및
        불만 처리{'\n'}
        {'\n'}
        2. 수집 및 이용 항목{'\n'}- 가입한 이동통신사, 고객의 생년월일,
        휴대전화번호, 성명, 성별, 내/외국인 구분{'\n'}- 연계정보(CI),
        중복가입확인정보(DI){'\n'}- 고객이 이용하는 웹사이트{'\n'}
        {'\n'}
        3. 보유 및 이용기간{'\n'}- 본인확인 시점으로부터 2년까지(단,
        연계정보(CI), 중복가입확인정보(DI)는 서비스 제공 후 지체없이 삭제){'\n'}
        {'\n'}※ 고객님은 위 동의를 거부할 권리가 있으나, 동의를 거부하실 경우
        서비스 가입 및 이용에 제약이 있을 수 있습니다. 더 자세한 내용에 대해서는
        [개인정보처리방침]을 참고하시기 바랍니다.{'\n'}
        {'\n'}
        {'\n'}
        [㈜드림시큐리티 귀중]{'\n'}
        ㈜드림시큐리티 (이하 "회사")는 LG유플러스㈜ 통신사로부터 위탁받아
        제공하는 휴대폰 본인인증 서비스와 관련하여 고객으로부터 수집한
        개인정보를 이용 및 제공하고자 합니다.{'\n'}
        이에 본인은 “회사”가 아래와 같이 개인정보를 이용 및 제공하는 데
        동의합니다.{'\n'}
        {'\n'}
        제1조 (개인정보의 수집 및 이용 목적){'\n'}
        "회사"는 "고객"의 개인정보를 아래의 목적으로 이용할 수 있습니다.{'\n'}①
        휴대폰기반 본인확인 서비스 제공{'\n'}② 휴대폰 본인인증 서비스 문의사항
        응대{'\n'}③ 휴대폰번호도용방지서비스 가입여부확인 (서비스 가입자에 한함)
        {'\n'}
        {'\n'}
        제2조 (수집하는 개인정보의 항목){'\n'}- 성명, 성별, 생년월일, 내/외국인
        구분{'\n'}- 연계정보(CI), 중복가입확인정보(DI){'\n'}- 휴대폰번호,
        이동통신사, IP주소{'\n'}
        {'\n'}
        제3조 (개인정보의 보유 및 이용기간){'\n'}
        "회사"는 법령에 따른 개인정보 보유•이용기간 또는 정보주체로부터
        개인정보를 수집 시에 동의받은 개인정보 보유•이용기간 내에서 개인정보를
        처리•보존합니다.{'\n'}① 휴대폰기반 본인확인 서비스 제공: 목적 달성 후
        즉시 파기{'\n'}② 휴대폰 본인인증 서비스 문의사항 응대: 3년{'\n'}③
        휴대폰번호도용방지서비스 가입여부확인: 목적 달성 후 즉시 파기{'\n'}
        {'\n'}
        제4조 (개인정보의 제공){'\n'}① 휴대폰기반 본인확인 서비스 제공{'\n'}-
        제공받는 자: “회사”와 계약을 체결한 사업자(가맹점){'\n'}- 제공 목적:
        휴대폰기반 본인확인{'\n'}- 제공 항목: 성명, 생년월일, 성별, 휴대폰번호,
        내/외국인 구분, 이동통신사, 연계정보(CI), 중복가입확인정보(DI){'\n'}-
        보유 기간: 처리목적 달성 후 즉시 파기 (단, 법령상 보존 필요 시 또는 사전
        동의 시 보관){'\n'}
        {'\n'}② 휴대폰번호도용방지서비스 가입여부확인 (서비스 가입자에 한함)
        {'\n'}- 제공받는 자: ㈜헥토파이낸셜{'\n'}- 제공 목적:
        휴대폰번호도용방지서비스 가입여부확인{'\n'}- 제공 항목: 휴대폰번호,
        이동통신사{'\n'}- 보유 기간: 처리목적 달성 후 즉시 파기 (법령상 보존
        필요 시 또는 사전 동의 시 보관){'\n'}
        {'\n'}※ 개인정보 수집•이용 및 제공에 따른 동의는 거부할 수 있습니다.
        {'\n'}
        다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.
      </CustomText>
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default LGUpersonalinfo;
