import React from 'react';
import {StyleSheet, ScrollView} from 'react-native';
import CustomText from '../../../../utils/CustomText';

const LGUthirdpartyinfo = () => {
  return (
    <ScrollView contentContainerStyle={styles.container}>
      <CustomText style={styles.text}>
        개인정보 제3자 제공 동의{'\n'}
        {'\n'}
        "알뜰폰(MVNO) 사업자”(제1조에서 규정함)는 휴대폰 본인확인서비스(이하
        ‘서비스’)를 제공하기 위해 본인의 개인정보를 아래와 같이 제3자에게
        제공합니다.{'\n'}
        {'\n'}
        제1조 (알뜰폰(MVNO) 사업자){'\n'}
        ㈜엘지유플러스의 알뜰폰(MVNO) 사업자는 ACN코리아(플래시모바일),
        (주)에넥스텔레콤(A모바일), (주)에이프러스(아시아모바일),
        (주)CK커뮤스트리(슈가모바일), SL리테일(셀모바일),
        (주)코드모바일(이지모바일), 에르엘모바일, (주)아이즈비전(아이즈모바일),
        (주)핀샷(코인샷모바일), LG헬로비전(헬로모바일), 한패스모바일,
        (주)보스(화인통신), 사람과연결, 인스코리아(인스모바일), 조이텔,
        KB국민은행(리브모바일), 제주방송, (주)코나아이(모나),
        (주)KG모빌리언스(KG모바일), (주)큰사람커넥트(이야기모바일), 토스모바일,
        (주)미디어로그(U+유모바일), (주)마블프로듀스(마블링),
        엔페이넷(니즈텔레콤), (주)앤알커뮤니케이션(앤텔레콤), 엔티온텔레콤,
        원텔레콤, (주)스테이지파이브(핀다이렉트), 한국피엠오㈜(벨류컴),
        (주)레그원(온국민폰), 에스원안심모바일, 서경모바일, 세종텔레콤(스노우맨),
        스마텔, (주)인스코비(프리티), (주)한국케이블텔레콤(티플러스),
        (주)유니컴즈(모빙), (주)와이드모바일(도시락모바일), (주)위너스텔(well),
        시월텔레콤(시월모바일), ㈜친구아이앤씨(친구모바일), 찬스모바일,
        우리은행(우리WON모바일), 아정커뮤니케이션(아정당모바일), 주식회사
        우들(우들모바일) 입니다.{'\n'}
        {'\n'}
        제2조 (제공받는 자의 개인정보 이용 목적){'\n'}
        본인확인서비스 제공{'\n'}
        {'\n'}
        제3조 (제공하는 개인정보의 항목){'\n'}
        성명, 휴대전화번호, 생년월일, 내·외국인 구분, 성별{'\n'}
        {'\n'}
        제4조 (제공받는 자){'\n'}
        (주)엘지유플러스{'\n'}
        {'\n'}
        제5조 (제공받는 자의 개인정보 보유 및 이용기간){'\n'}
        서비스 제공 완료시까지{'\n'}
        {'\n'}※ “본인”은 위 동의를 거부할 권리가 있으나, 동의를 거부하실 경우
        서비스 이용에 제약이 있을 수 있습니다.
      </CustomText>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default LGUthirdpartyinfo;
