import React from 'react';
import {View, Text, StyleSheet, ScrollView} from 'react-native';
import CustomText from '../../../common/CustomText';

const LGUthirdpartyinfo = () => {
  return (
    <ScrollView contentContainerStyle={styles.container}>
      <CustomText style={styles.text}>
        본인확인서비스 제3자 정보제공 동의{'\n'}
        "알뜰폰(MVNO)"사업자는 다음과 같이 개인정보를 제3자에게 제공하고
        있습니다.{'\n'}
        {'\n'}
        제1조 (알뜰폰(MVNO) 사업자){'\n'}
        LG유플러스㈜의 알뜰폰(MVNO) 사업자는 스마텔,
        LG헬로비전(헬로모바일),토스모바일㈜,㈜큰사람커넥트(이야기모바일),㈜프리텔레콤(프리티),㈜아이즈비전(아이즈모바일),스테이지파이브(핀다이렉트),KB국민은행(KB리브모바일),㈜유니컴즈(모빙),㈜와이엘랜드(여유텔레콤),㈜위너스텔(well),에스원(안심모바일),㈜에넥스텔레콤(A모바일),㈜인스코비(프리티),㈜엠티티텔레콤(메리큐),㈜한국케이블텔레콤(티플러스),㈜코드모바일(이지모바일),앤알커뮤니케이션(앤텔레콤),(㈜니즈텔레콤(니즈모바일),㈜에이프러스(아시아모바일),
        ACN코리아(플래시모바일),원텔레콤,에르엘모바일,㈜미디어로그(U+유모바일),제주방송,남인천방송,금강방송,KG모빌리언스(KG모바일),레그원(온국민폰),조이텔(조이텔),엔티온텔레콤,인스코리아(인스모바일),
        한국피엠오㈜(벨류컴),㈜와이드모바일(도시락모바일),㈜CK커뮤스트리(슈가모바일),㈜마블프로듀스(마블링),사람과연결,SL리테일(셀모바일),㈜코나아이(모나),㈜핀샷(코인샷),한패스인터내셔널(한패스모바일),㈜보스(화인통신),글로벌머니익스프레스(GME모바일),㈜친구아이앤씨(친구모바일),찬스모바일,우리은행(우리WON모바일)입니다.
        {'\n'}
        {'\n'}
        제2조 (제공목적){'\n'}본 동의는 본인확인 서비스를 제공하기 위하여
        본인확인기관인 LG유플러스㈜와 본인확인서비스 이용자간 본인확인서비스
        이용에 필요한 고객정보를 위탁하여 본인확인서비스를 제공하는 것에 대해
        동의합니다.{'\n'}
        {'\n'}
        제3조 (제공정보){'\n'}
        휴대폰 본인확인 서비스 제공에 필요한 개인정보로 성명, 휴대폰번호,
        생년월일, 내·외국인구분, 성별 정보입니다.{'\n'}
        {'\n'}
        제4조 (제공받는자){'\n'}
        LG유플러스㈜{'\n'}
        {'\n'}
        제5조 (제공기간){'\n'}
        이동통신사에서 보유중인 정보로서 별도 이용기간은 없습니다.{'\n'}
        {'\n'}위 개인정보 수집,이용 및 취급위탁에 동의하지 않을 권리가 있으며,
        동의하지 않으실 경우 서비스를 이용할 수 없습니다.
      </CustomText>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default LGUthirdpartyinfo;
