import React from 'react';
import {View, Text, StyleSheet, ScrollView} from 'react-native';
import CustomText from '../../../common/CustomText';

const SKTpersonalinfo = () => {
  return (
    <View contentContainerStyle={styles.container}>
      <CustomText style={styles.text}>
        개인정보 이용 동의{'\n'}
        [SK텔레콤 귀중]{'\n'}
        {'\n'}
        본인은SK텔레콤㈜(이하 ‘회사’라 합니다)가 제공하는 본인확인서비스(이하
        ‘서비스’라 합니다)를 이용하기 위해, 다음과 같이 ‘회사’가 본인의
        개인정보를 수집/이용하고, 개인정보의 취급을 위탁하는 것에 동의합니다.
        {'\n'}
        {'\n'}
        1. 수집항목{'\n'}
        -이용자의 성명, 이동전화번호, 가입한 이동전화 회사, 생년월일, 성별{'\n'}
        -연계정보(CI), 중복가입확인정보(DI){'\n'}
        -이용자가 이용하는 웹사이트 또는 Application정보, 이용일시{'\n'}
        -내외국인여부{'\n'}
        -가입한 이동전화회사 및 이동전화브랜드{'\n'}
        {'\n'}
        2. 이용목적{'\n'}
        -이용자가 웹사이트 또는 Application에 입력한 본인확인정보의 정확성
        여부확인(본인확인서비스 제공){'\n'}
        -해당 웹사이트 또는 Application에 연계정보(CI)/중복가입확인정보(DI) 전송
        {'\n'}
        -서비스 관련 상담 및 불만 처리 등{'\n'}
        -이용 웹사이트/Application 정보 등에 대한 분석 및 세분화를 통한,
        이용자의 서비스 이용 선호도 분석{'\n'}
        {'\n'}
        3. 개인정보의 보유기간 및 이용기간{'\n'}- 이용자가 서비스를 이용하는
        기간에 한하여 보유 및 이용. 다만, 아래의 경우는 제외{'\n'}- 법령에서
        정하는 경우 해당 기간까지 보유(상세 사항은 회사의 개인정보처리방침에
        기재된 바에 따름){'\n'}
        {'\n'}
        4. 본인확인서비스 제공을 위한 개인정보의 취급위탁{'\n'}
        -수탁자 : NICE평가정보㈜, ㈜다날, ㈜드림시큐리티, SCI평가정보㈜,
        SK플래닛㈜, NHN한국사이버결제㈜, (주)KG모빌리언스, 코리아크레딧뷰로(주),
        한국모바일인증(주){'\n'}
        -취급위탁 업무 : 본인확인정보의 정확성 여부 확인(본인확인서비스 제공),
        연계정보(C)/중복가입확인정보(DI) 생성 및 전송, 서비스 관련 상담 및
        불만처리, 휴대폰인증보호서비스, 이용자의 서비스 이용 선호도 분석정보
        제공 관련 시스템 구축·광고매체 연동 및 위탁영업 등{'\n'}※ 수탁자의 상세
        개인정보 취급위탁 내용은 각 수탁자가 정하는 절차와 방법에 따라 수탁자
        홈페이지 등에 게시된 수탁자의 개인정보처리방침 및 제3자 제공 동의 방침
        등에 따릅니다.{'\n'}
        {'\n'}
        5. 위 개인정보 수집,이용 및 취급위탁에 동의하지 않을 권리가 있으며,
        동의하지 않으실 경우 서비스를 이용할 수 없습니다.{'\n'}※ ‘회사’가
        제공하는 서비스와 관련된 개인정보 취급과 관련된 사항은, ‘회사’의
        개인정보처리방침(회사 홈페이지 www.sktelecom.com)에 따릅니다.{'\n'}
        {'\n'}
        [㈜드림시큐리티 귀중]{'\n'}
        ㈜드림시큐리티 (이하 "회사")는 에스케이텔레콤㈜ 통신사로부터 위탁받아
        제공하는 휴대폰 본인인증 서비스와 관련하여 고객으로부터 수집한
        개인정보를 이용 및 제공하고자 합니다. 이에 본인은 “회사”가 아래와 같이
        개인정보를 이용 및 제공하는데 동의합니다.{'\n'}
        {'\n'}
        제1조 (개인정보의 수집 및 이용목적){'\n'}
        "회사"는 "고객"의 개인정보를 아래의 목적으로 이용할 수 있습니다.{'\n'}①
        휴대폰기반 본인확인 서비스 제공{'\n'}② 휴대폰 본인인증 서비스 문의사항
        응대{'\n'}③ 휴대폰인증보호서비스/휴대폰번호도용방지서비스
        가입여부확인(서비스 가입자에 한함){'\n'}
        {'\n'}
        제2조 (수집하는 개인정보의 항목){'\n'}
        1. 성명, 성별, 생년월일, 내/외국인 구분{'\n'}
        2. 연계정보(CI), 중복가입확인정보(DI){'\n'}
        3. 휴대폰번호, 이동통신사{'\n'}
        4. IP주소{'\n'}
        {'\n'}
        제3조 (개인정보의 보유 및 이용기간){'\n'}
        "회사"는 법령에 따른 개인정보 보유•이용기간 또는 정보주체로부터
        개인정보를 수집 시에 동의 받은 개인정보 보유•이용기간 내에서 개인정보를
        처리•보존합니다.{'\n'}① 휴대폰기반 본인확인 서비스 제공: 목적 달성 후
        즉시파기{'\n'}② 휴대폰 본인인증 서비스 문의사항 응대: 3년{'\n'}③
        휴대폰인증보호서비스/휴대폰번호도용방지서비스 가입여부확인(서비스
        가입자에 한함): 목적 달성 후 즉시 파기{'\n'}
        {'\n'}
        제4조 (개인정보의 제공){'\n'}① 휴대폰기반 본인확인 서비스 제공{'\n'}
        -제공받는 자: “회사”와 계약을 체결한 사업자(가맹점){'\n'}
        -제공 목적: 휴대폰기반 본인확인{'\n'}
        -제공 항목: 성명, 생년월일, 성별, 휴대폰번호, 내/외국인 구분,
        이동통신사, 연계정보(CI), 중복가입확인정보(DI){'\n'}
        -보유 기간: 처리목적 달성 후 즉시 파기 (단, 관계 법령의 규정에 의하여
        보존할 필요가 있는 경우 또는 사전 동의를 득한 경우 해당 보유기간 동안
        보관){'\n'}
        {'\n'}② 휴대폰인증보호서비스/휴대폰번호도용방지서비스
        가입여부확인(서비스 가입자에 한함){'\n'}
        -제공받는 자: ㈜헥토파이낸셜, ㈜한국인증플랫폼즈{'\n'}
        -제공 목적: 휴대폰인증보호서비스/휴대폰번호도용방지서비스 가입여부확인
        {'\n'}
        -제공 항목: 휴대폰번호, 이동통신사{'\n'}
        -보유 기간: 처리목적 달성 후 즉시 파기 (단, 관계 법령의 규정에 의하여
        보존할 필요가 있는 경우 또는 사전 동의를 득한 경우 해당 보유기간 동안
        보관){'\n'}
        {'\n'}※ 개인정보 수집•이용 및 제공에 따른 동의는 거부할 수 있습니다.
        다만, 동의 거부 시에는 서비스 이용이 제한될 수 있습니다.{'\n'}
      </CustomText>
    </View>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
    backgroundColor: 'white',
  },
  text: {
    fontSize: 13,
    lineHeight: 22,
    color: '#333',
  },
});

export default SKTpersonalinfo;
